In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

In [3]:
#Load airbnb csv file

prices= pd.read_csv('Dataset/airbnb_price.csv')
prices

       listing_id        price                 nbhood_full
0            2595  225 dollars          Manhattan, Midtown
1            3831   89 dollars      Brooklyn, Clinton Hill
2            5099  200 dollars      Manhattan, Murray Hill
3            5178   79 dollars   Manhattan, Hell's Kitchen
4            5238  150 dollars        Manhattan, Chinatown
...           ...          ...                         ...
25204    36425863  129 dollars  Manhattan, Upper East Side
25205    36427429   45 dollars            Queens, Flushing
25206    36438336  235 dollars  Staten Island, Great Kills
25207    36442252  100 dollars           Bronx, Mott Haven
25208    36455809   30 dollars          Brooklyn, Bushwick

[25209 rows x 3 columns]

In [4]:
# Load reviews data
reviews= pd.read_csv('Dataset/airbnb_last_review.tsv', sep='\t')
reviews

       listing_id    host_name   last_review
0            2595     Jennifer   May 21 2019
1            3831  LisaRoxanne  July 05 2019
2            5099        Chris  June 22 2019
3            5178     Shunichi  June 24 2019
4            5238          Ben  June 09 2019
...           ...          ...           ...
25204    36425863        Rusaa  July 07 2019
25205    36427429         H Ai  July 07 2019
25206    36438336          Ben  July 07 2019
25207    36442252       Blaine  July 07 2019
25208    36455809    Christine  July 08 2019

[25209 rows x 3 columns]

In [5]:
xls= pd.ExcelFile('Dataset/airbnb_room_type.xlsx')
room_type=xls.parse(0)
room_type

       listing_id                                 description        room_type
0            2595                       Skylit Midtown Castle  Entire home/apt
1            3831             Cozy Entire Floor of Brownstone  Entire home/apt
2            5099   Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3            5178             Large Furnished Room Near B'way     private room
4            5238          Cute & Cozy Lower East Side 1 bdrm  Entire home/apt
...           ...                                         ...              ...
25204    36425863  Lovely Privet Bedroom with Privet Restroom     PRIVATE ROOM
25205    36427429                    No.2 with queen size bed     PRIVATE ROOM
25206    36438336                             Seas The Moment     Private room
25207    36442252               1B-1B apartment near by Metro  Entire home/apt
25208    36455809     Cozy Private Room in Bushwick, Brooklyn     Private room

[25209 rows x 3 columns]

In [6]:
# A function written to display dataframes together
from IPython.display import HTML

def side_by_side(*dfs):
    html = '<div style="display:flex">'
    for df in dfs:
        html += '<div style="margin-right: 2em">'
        html += df.to_html()
        html += '</div>'
    html += '</div>'
    display(HTML(html))

In [7]:
side_by_side(prices.head(), room_type.head(), reviews.head())

In [8]:
prices.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   price        25209 non-null  object
 2   nbhood_full  25209 non-null  object
dtypes: int64(1), object(2)
memory usage: 591.0+ KB

In [9]:
reviews.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   host_name    25201 non-null  object
 2   last_review  25209 non-null  object
dtypes: int64(1), object(2)
memory usage: 591.0+ KB

In [10]:
reviews.isnull().sum()

listing_id     0
host_name      8
last_review    0
dtype: int64

In [11]:
prices.isnull().sum()

listing_id     0
price          0
nbhood_full    0
dtype: int64

In [12]:
room_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   description  25199 non-null  object
 2   room_type    25209 non-null  object
dtypes: int64(1), object(2)
memory usage: 591.0+ KB

In [13]:
room_type.isnull().sum()

listing_id      0
description    10
room_type       0
dtype: int64

In [14]:
prices.describe()

         listing_id
count  2.520900e+04
mean   2.068922e+07
std    1.102928e+07
min    2.595000e+03
25%    1.202273e+07
50%    2.234391e+07
75%    3.037669e+07
max    3.645581e+07

In [15]:
prices['price']

0        225 dollars
1         89 dollars
2        200 dollars
3         79 dollars
4        150 dollars
            ...
25204    129 dollars
25205     45 dollars
25206    235 dollars
25207    100 dollars
25208     30 dollars
Name: price, Length: 25209, dtype: object

In [27]:
prices['price']=prices['price'].str.replace('dollars','')

prices['price']= pd.to_numeric(prices['price'])
prices['price']

AttributeError: Can only use .str accessor with string values!

In [30]:
(prices['price']).dtype

dtype('int64')

In [31]:
prices['price'].head()

0    225
1     89
2    200
3     79
4    150
Name: price, dtype: int64

In [32]:
prices['price'].describe()

count    25209.000000
mean       141.777936
std        147.349137
min          0.000000
25%         69.000000
50%        105.000000
75%        175.000000
max       7500.000000
Name: price, dtype: float64

In [35]:
Free_listing= prices['price']==0
prices[Free_listing]

       listing_id  price                   nbhood_full
10861    20333471      0        Bronx, East Morrisania
10958    20523843      0            Brooklyn, Bushwick
11023    20639628      0  Brooklyn, Bedford-Stuyvesant
11024    20639792      0  Brooklyn, Bedford-Stuyvesant
11025    20639914      0  Brooklyn, Bedford-Stuyvesant
11577    21291569      0            Brooklyn, Bushwick
11589    21304320      0            Brooklyn, Bushwick

In [36]:
type(Free_listing)

pandas.core.series.Series

In [37]:
Free_listing.shape

(25209,)

In [38]:
prices= prices.loc[~Free_listing]
prices

       listing_id  price                 nbhood_full
0            2595    225          Manhattan, Midtown
1            3831     89      Brooklyn, Clinton Hill
2            5099    200      Manhattan, Murray Hill
3            5178     79   Manhattan, Hell's Kitchen
4            5238    150        Manhattan, Chinatown
...           ...    ...                         ...
25204    36425863    129  Manhattan, Upper East Side
25205    36427429     45            Queens, Flushing
25206    36438336    235  Staten Island, Great Kills
25207    36442252    100           Bronx, Mott Haven
25208    36455809     30          Brooklyn, Bushwick

[25202 rows x 3 columns]

In [40]:
prices.count()

listing_id     25202
price          25202
nbhood_full    25202
dtype: int64

In [42]:
avg_price= round(prices['price'].mean(),2)
print(f"The average price per night for an Airbnb listing in NYC is ${avg_price}")

The average price per night for an Airbnb listing in NYC is $141.82

In [43]:
room_type

       listing_id                                 description        room_type
0            2595                       Skylit Midtown Castle  Entire home/apt
1            3831             Cozy Entire Floor of Brownstone  Entire home/apt
2            5099   Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3            5178             Large Furnished Room Near B'way     private room
4            5238          Cute & Cozy Lower East Side 1 bdrm  Entire home/apt
...           ...                                         ...              ...
25204    36425863  Lovely Privet Bedroom with Privet Restroom     PRIVATE ROOM
25205    36427429                    No.2 with queen size bed     PRIVATE ROOM
25206    36438336                             Seas The Moment     Private room
25207    36442252               1B-1B apartment near by Metro  Entire home/apt
25208    36455809     Cozy Private Room in Bushwick, Brooklyn     Private room

[25209 rows x 3 columns]

In [44]:
reviews

       listing_id    host_name   last_review
0            2595     Jennifer   May 21 2019
1            3831  LisaRoxanne  July 05 2019
2            5099        Chris  June 22 2019
3            5178     Shunichi  June 24 2019
4            5238          Ben  June 09 2019
...           ...          ...           ...
25204    36425863        Rusaa  July 07 2019
25205    36427429         H Ai  July 07 2019
25206    36438336          Ben  July 07 2019
25207    36442252       Blaine  July 07 2019
25208    36455809    Christine  July 08 2019

[25209 rows x 3 columns]

In [45]:
prices.info()

<class 'pandas.core.frame.DataFrame'>
Index: 25202 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25202 non-null  int64
 1   price        25202 non-null  int64
 2   nbhood_full  25202 non-null  object
dtypes: int64(2), object(1)
memory usage: 787.6+ KB

In [46]:
prices.head()

   listing_id  price                nbhood_full
0        2595    225         Manhattan, Midtown
1        3831     89     Brooklyn, Clinton Hill
2        5099    200     Manhattan, Murray Hill
3        5178     79  Manhattan, Hell's Kitchen
4        5238    150       Manhattan, Chinatown

In [50]:
prices['price_per_month']= prices['price']* 365/12
prices['price_per_month']

average_price_per_month= round(prices['price_per_month'].mean(),2)
average_price_per_month

print("Airbnb monthly costs are ${}, while in the private market you would pay {}.".format(average_price_per_month, "$3,100.00"))

Airbnb monthly costs are $4313.61, while in the private market you would pay $3,100.00.

/var/folders/6y/q1lkt6b131s1hmrf_wg0bq640000gn/T/ipykernel_2867/851272586.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  prices['price_per_month']= prices['price']* 365/12

In [51]:
average_price_per_month

4313.61

In [52]:
prices['price_per_month']

0        6843.750000
1        2707.083333
2        6083.333333
3        2402.916667
4        4562.500000
            ...
25204    3923.750000
25205    1368.750000
25206    7147.916667
25207    3041.666667
25208     912.500000
Name: price_per_month, Length: 25202, dtype: float64

In [57]:
prices[prices['listing_id']==36425863]

       listing_id  price                 nbhood_full  price_per_month
25204    36425863    129  Manhattan, Upper East Side          3923.75

In [58]:
room_type.head()

   listing_id                                description        room_type
0        2595                      Skylit Midtown Castle  Entire home/apt
1        3831            Cozy Entire Floor of Brownstone  Entire home/apt
2        5099  Large Cozy 1 BR Apartment In Midtown East  Entire home/apt
3        5178            Large Furnished Room Near B'way     private room
4        5238         Cute & Cozy Lower East Side 1 bdrm  Entire home/apt

In [59]:
room_type['room_type']=room_type['room_type'].str.lower()
room_type['room_type']

0        entire home/apt
1        entire home/apt
2        entire home/apt
3           private room
4        entire home/apt
              ...
25204       private room
25205       private room
25206       private room
25207    entire home/apt
25208       private room
Name: room_type, Length: 25209, dtype: object

In [60]:
room_type.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 25209 entries, 0 to 25208
Data columns (total 3 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   listing_id   25209 non-null  int64
 1   description  25199 non-null  object
 2   room_type    25209 non-null  object
dtypes: int64(1), object(2)
memory usage: 591.0+ KB

In [61]:
room_type['room_type'].astype('category')

0        entire home/apt
1        entire home/apt
2        entire home/apt
3           private room
4        entire home/apt
              ...
25204       private room
25205       private room
25206       private room
25207    entire home/apt
25208       private room
Name: room_type, Length: 25209, dtype: category
Categories (3, object): ['entire home/apt', 'private room', 'shared room']

In [62]:
room_freq= room_type['room_type'].value_counts()
room_freq

room_type
entire home/apt    13266
private room       11356
shared room          587
Name: count, dtype: int64